# Import software libraries

In [1]:
# Import required libraries.
import sys           # Read system parameters.
import pandas as pd  # Manipulate and analyze data.
import sqlite3       # Manage SQL databases.

# Summarize software libraries used.
print('Libraries used in this project:')
print('- Python {}'.format(sys.version))
print('- pandas {}'.format(pd.__version__))
print('- sqlite3 {}'.format(sqlite3.sqlite_version))

Libraries used in this project:
- Python 3.7.6 | packaged by conda-forge | (default, Mar 23 2020, 23:03:20)
[GCC 7.3.0]
- pandas 1.1.3
- sqlite3 3.30.1

# Examine the database

In [11]:
# Connect to SQLite database.
conn = sqlite3.connect('data/prod_sample.db')

In [12]:
# List all the tables in the database.
query = "SELECT name FROM sqlite_master WHERE type='table'"
pd.read_sql(query,conn)

                    name
0      stock_description
1  online_retail_history

# Read data from the `online_retail_history` table

In [15]:
# Write the query to be executed that selects everything from the online_retail_history table.
query = "SELECT * FROM online_retail_history"



# Use the read_sql function in pandas to read a query into a DataFrame.
online_retail_history_df = pd.read_sql(query,conn)


# Preview the first five rows of the data.
online_retail_history_df.head(5)

,Invoice,StockCode,Quantity,InvoiceDate,Price,CustomerID,Country,TotalAmount
0,536365,85123A,6,2010-12-01 08:26:00,2.55,u1785,United Kingdom,15.30
1,536367,84879,32,2010-12-01 08:34:00,1.69,u13047,United Kingdom,54.08
2,536373,85123A,6,2010-12-01 09:02:00,2.55,u1785,United Kingdom,15.30
3,536375,85123A,6,2010-12-01 09:32:00,2.55,u1785,United Kingdom,15.30
4,536378,20725,10,2010-12-01 09:37:00,1.65,u14688,United Kingdom,16.50

In [16]:
# Get the shape of the data.
online_retail_history_df.shape

(15321, 8)

# Read data from the `stock_description` table

In [18]:
# Write the query to be executed that selects everything from the online_retail_history table.
query = "SELECT * FROM stock_description"



# Use the read_sql function in pandas to read a query into a DataFrame.
stock_description_df = pd.read_sql(query,conn)


# Preview the first five rows of the data.
stock_description_df.head(5)

  StockCode                  Description
0     10002  INFLATABLE POLITICAL GLOBE
1     10080     GROOVY CACTUS INFLATABLE
2     10120                 DOGGY RUBBER
3    10123C        HEARTS WRAPPING TAPE
4    10124A  SPOTS ON RED BOOKCOVER TAPE

In [19]:
# Get the shape of the data.
stock_description_df.shape

(3952, 2)

# Aggregate the `online_retail_history` and `stock_description` datasets

In [20]:
stock_description_df.head()

  StockCode                  Description
0     10002  INFLATABLE POLITICAL GLOBE
1     10080     GROOVY CACTUS INFLATABLE
2     10120                 DOGGY RUBBER
3    10123C        HEARTS WRAPPING TAPE
4    10124A  SPOTS ON RED BOOKCOVER TAPE

In [21]:
online_retail_history_df.head()

,Invoice,StockCode,Quantity,InvoiceDate,Price,CustomerID,Country,TotalAmount
0,536365,85123A,6,2010-12-01 08:26:00,2.55,u1785,United Kingdom,15.30
1,536367,84879,32,2010-12-01 08:34:00,1.69,u13047,United Kingdom,54.08
2,536373,85123A,6,2010-12-01 09:02:00,2.55,u1785,United Kingdom,15.30
3,536375,85123A,6,2010-12-01 09:32:00,2.55,u1785,United Kingdom,15.30
4,536378,20725,10,2010-12-01 09:37:00,1.65,u14688,United Kingdom,16.50

In [22]:
# Write a query to aggregate the two datasets so that you have the stock descriptions as well as the stock code.
query = """SELECT o.*,s.Description FROM
           online_retail_history AS o LEFT JOIN stock_description AS s
           ON o.StockCode = s.StockCode"""





# Use the read_sql function in pandas to read a query into a DataFrame.
aggregated_df = pd.read_sql(query,conn)


# Preview the first five rows of the data.
aggregated_df.head()

,Invoice,StockCode,Quantity,InvoiceDate,Price,CustomerID,Country,TotalAmount,Description
0,536365,85123A,6,2010-12-01 08:26:00,2.55,u1785,United Kingdom,15.30,CREAM HANGING HEART T-LIGHT HOLDER
1,536367,84879,32,2010-12-01 08:34:00,1.69,u13047,United Kingdom,54.08,ASSORTED COLOUR BIRD ORNAMENT
2,536373,85123A,6,2010-12-01 09:02:00,2.55,u1785,United Kingdom,15.30,CREAM HANGING HEART T-LIGHT HOLDER
3,536375,85123A,6,2010-12-01 09:32:00,2.55,u1785,United Kingdom,15.30,CREAM HANGING HEART T-LIGHT HOLDER
4,536378,20725,10,2010-12-01 09:37:00,1.65,u14688,United Kingdom,16.50,LUNCH BAG RED RETROSPOT

In [23]:
# Get the shape of the data.
aggregated_df.shape

(17032, 9)

# Identify and fix corrupt or unusable data

In [24]:
# Check the value counts of the "Description" field.
aggregated_df.Description.value_counts()

CREAM HANGING HEART T-LIGHT HOLDER    2174
JUMBO BAG RED RETROSPOT               1960
?                                     1711
REGENCY CAKESTAND 3 TIER              1711
PARTY BUNTING                         1615
LUNCH BAG RED RETROSPOT               1421
ASSORTED COLOUR BIRD ORNAMENT         1405
POPCORN HOLDER                        1329
LUNCH BAG  BLACK SKULL.               1271
SET OF 3 CAKE TINS PANTRY DESIGN      1257
PACK OF 72 RETROSPOT CAKE CASES       1178
Name: Description, dtype: int64

In [25]:
aggregated_df.head()

,Invoice,StockCode,Quantity,InvoiceDate,Price,CustomerID,Country,TotalAmount,Description
0,536365,85123A,6,2010-12-01 08:26:00,2.55,u1785,United Kingdom,15.30,CREAM HANGING HEART T-LIGHT HOLDER
1,536367,84879,32,2010-12-01 08:34:00,1.69,u13047,United Kingdom,54.08,ASSORTED COLOUR BIRD ORNAMENT
2,536373,85123A,6,2010-12-01 09:02:00,2.55,u1785,United Kingdom,15.30,CREAM HANGING HEART T-LIGHT HOLDER
3,536375,85123A,6,2010-12-01 09:32:00,2.55,u1785,United Kingdom,15.30,CREAM HANGING HEART T-LIGHT HOLDER
4,536378,20725,10,2010-12-01 09:37:00,1.65,u14688,United Kingdom,16.50,LUNCH BAG RED RETROSPOT

In [29]:
# Remove rows where "Description" is just a question mark (?).

aggregated_df = aggregated_df[~ (aggregated_df['Description'] == '?')]





# Preview the first five rows of the data.

aggregated_df.shape

(15321, 9)

# Identify and remove duplicates

In [39]:
# Identify all duplicated data.
duplicated = aggregated_df[aggregated_df.duplicated()]


duplicated.shape

(115, 9)

In [40]:
# Print the duplicated data.
duplicated.head()

,Invoice,StockCode,Quantity,InvoiceDate,Price,CustomerID,Country,TotalAmount,Description
178,536863,20727,1,2010-12-03 11:19:00,1.65,u17967,United Kingdom,1.65,LUNCH BAG BLACK SKULL.
497,537781,84879,8,2010-12-08 12:46:00,1.69,u17341,United Kingdom,13.52,ASSORTED COLOUR BIRD ORNAMENT
571,537955,20725,1,2010-12-09 11:28:00,1.65,u16782,United Kingdom,1.65,LUNCH BAG RED RETROSPOT
935,539092,22423,16,2010-12-16 10:08:00,10.95,u15482,United Kingdom,175.20,REGENCY CAKESTAND 3 TIER
1068,539475,22197,1,2010-12-19 14:41:00,0.85,u16686,United Kingdom,0.85,POPCORN HOLDER

In [48]:
# Remove the duplicated data.
aggregated_df = aggregated_df.drop(duplicated.index)





# Preview the first five rows of the data.

aggregated_df.shape

(15206, 9)

# Correct date formats

In [49]:
# Get the data types for every column in the DataFrame.

aggregated_df.dtypes

Invoice         object
StockCode       object
Quantity         int64
InvoiceDate     object
Price          float64
CustomerID      object
Country         object
TotalAmount    float64
Description     object
dtype: object

In [50]:
# Convert "InvoiceDate" to a "%Y-%m-%d" datetime format.
aggregated_df['InvoiceDate'] = pd.to_datetime(aggregated_df['InvoiceDate'],format='%Y-%m-%d')

In [51]:
# Get the data types for every column in the converted DataFrame.
aggregated_df.dtypes

Invoice                object
StockCode              object
Quantity                int64
InvoiceDate    datetime64[ns]
Price                 float64
CustomerID             object
Country                object
TotalAmount           float64
Description            object
dtype: object

# Examine the table before finishing

In [52]:
# Preview the first five rows of the data.
aggregated_df.head()

,Invoice,StockCode,Quantity,InvoiceDate,Price,CustomerID,Country,TotalAmount,Description
0,536365,85123A,6,2010-12-01 08:26:00,2.55,u1785,United Kingdom,15.30,CREAM HANGING HEART T-LIGHT HOLDER
1,536367,84879,32,2010-12-01 08:34:00,1.69,u13047,United Kingdom,54.08,ASSORTED COLOUR BIRD ORNAMENT
2,536373,85123A,6,2010-12-01 09:02:00,2.55,u1785,United Kingdom,15.30,CREAM HANGING HEART T-LIGHT HOLDER
3,536375,85123A,6,2010-12-01 09:32:00,2.55,u1785,United Kingdom,15.30,CREAM HANGING HEART T-LIGHT HOLDER
4,536378,20725,10,2010-12-01 09:37:00,1.65,u14688,United Kingdom,16.50,LUNCH BAG RED RETROSPOT

# Load the dataset into a pickle file

In [53]:
# Save the dataset as a pickle file named online_history_cleaned.pickle.
aggregated_df.to_pickle('online_history_cleaned.pickle')

In [54]:
# Close any connections to the database.
conn.close()